[
  [
    {
      "question_number": "1",
      "question_description": "For this question, refer to the EHR Healthcare case study. You are responsible for ensuring that EHR's use of Google Cloud will  pass an upcoming privacy compliance audit. What should you do? (Choose two.)",
      "options": {
        "A": "Verify EHR's product usage against the list of compliant products on the Google Cloud compliance page.   Most Voted",
        "B": "Advise EHR to execute a Business Associate Agreement (BAA) with Google Cloud.   Most Voted",
        "C": "Use Firebase Authentication for EHR's user facing applications.",
        "D": "Implement Prometheus to detect and prevent security breaches on EHR's web-based applications.",
        "E": "Use GKE private clusters for all Kubernetes workloads."
      },
      "correct_answer": [
        "A",
        "B"
      ]
    }
  ],
  [
    {
      "question_number": "2",
      "question_description": "For this question, refer to the EHR Healthcare case study. You need to define the technical architecture for securely deploying  workloads to Google Cloud. You also need to ensure that only verified containers are deployed using Google Cloud services.  What should you do? (Choose two.)",
      "options": {
        "A": "Enable Binary Authorization on GKE, and sign containers as part of a CI/CD pipeline.   Most Voted",
        "B": "Configure Jenkins to utilize Kritis to cryptographically sign a container as part of a CI/CD pipeline.",
        "C": "Configure Container Registry to only allow trusted service accounts to create and deploy containers from the registry.",
        "D": "Configure Container Registry to use vulnerability scanning to confirm that there are no vulnerabilities before deploying  the workload.   Most Voted"
      },
      "correct_answer": [
        "A",
        "D"
      ]
    }
  ],
  [
    {
      "question_number": "3",
      "question_description": "You need to upgrade the EHR connection to comply with their requirements. The new connection design must support  business-critical needs and meet the same network and security policy requirements. What should you do?",
      "options": {
        "A": "Add a new Dedicated Interconnect connection.   Most Voted",
        "B": "Upgrade the bandwidth on the Dedicated Interconnect connection to 100 G.",
        "C": "Add three new Cloud VPN connections.",
        "D": "Add a new Carrier Peering connection."
      },
      "correct_answer": [
        "A"
      ]
    }
  ],
  [
    {
      "question_number": "4",
      "question_description": "For this question, refer to the EHR Healthcare case study. You need to define the technical architecture for hybrid connectivity  between EHR's on-premises systems and Google Cloud. You want to follow Google's recommended practices for production-  level applications. Considering the EHR Healthcare business and technical requirements, what should you do?",
      "options": {
        "A": "Configure two Partner Interconnect connections in one metro (City), and make sure the Interconnect connections are  placed in different metro zones.",
        "B": "Configure two VPN connections from on-premises to Google Cloud, and make sure the VPN devices on-premises are in  separate racks.",
        "C": "Configure Direct Peering between EHR Healthcare and Google Cloud, and make sure you are peering at least two Google  locations.",
        "D": "Configure two Dedicated Interconnect connections in one metro (City) and two connections in another metro, and make  sure the Interconnect connections are placed in different metro zones.   Most Voted"
      },
      "correct_answer": [
        "D"
      ]
    }
  ],
  [
    {
      "question_number": "5",
      "question_description": "For this question, refer to the EHR Healthcare case study. You are a developer on the EHR customer portal team. Your team  recently migrated the customer portal application to Google Cloud. The load has increased on the application servers, and now  the application is logging many timeout errors. You recently incorporated Pub/Sub into the application architecture, and the  application is not logging any Pub/Sub publishing errors. You want to improve publishing latency.   What should you do?",
      "options": {
        "A": "Increase the Pub/Sub Total Timeout retry value.",
        "B": "Move from a Pub/Sub subscriber pull model to a push model.",
        "C": "Turn off Pub/Sub message batching.   Most Voted",
        "D": "Create a backup Pub/Sub message queue."
      },
      "correct_answer": [
        "C"
      ]
    }
  ],
  [
    {
      "question_number": "6",
      "question_description": "For this question, refer to the EHR Healthcare case study. In the past, configuration errors put public IP addresses on backend  servers that should not have been accessible from the Internet. You need to ensure that no one can put external IP addresses  on backend Compute Engine instances and that external IP addresses can only be configured on frontend Compute Engine  instances. What should you do?",
      "options": {
        "A": "Create an Organizational Policy with a constraint to allow external IP addresses only on the frontend Compute Engine  instances.   Most Voted",
        "B": "Revoke the compute.networkAdmin role from all users in the project with front end instances.",
        "C": "Create an Identity and Access Management (IAM) policy that maps the IT staff to the compute.networkAdmin role for the  organization.",
        "D": "Create a custom Identity and Access Management (IAM) role named GCE_FRONTEND with the compute.addresses.create  permission."
      },
      "correct_answer": [
        "A"
      ]
    }
  ],
  [
    {
      "question_number": "7",
      "question_description": "For this question, refer to the EHR Healthcare case study. You are responsible for designing the Google Cloud network  architecture for Google Kubernetes   Engine. You want to follow Google best practices. Considering the EHR Healthcare business and technical requirements, what  should you do to reduce the attack surface?",
      "options": {
        "A": "Use a private cluster with a private endpoint with master authorized networks configured.   Most Voted",
        "B": "Use a public cluster with firewall rules and Virtual Private Cloud (VPC) routes.",
        "C": "Use a private cluster with a public endpoint with master authorized networks configured.",
        "D": "Use a public cluster with master authorized networks enabled and firewall rules."
      },
      "correct_answer": [
        "A"
      ]
    }
  ]
]